tutorials/CFD/19UnsteadyNSExplicit_Turb_RK4_caso7_9/0/UMean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      UMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type            calculated;
        value           uniform (1 0 0);
    }
    fixedWalls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
