tutorials/CFD/19UnsteadyNSExplicit_Turb_RK4_caso7_9/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;

// Number of modes to output and to use for projection
NmodesUout 10;
NmodesUproj 10;
NmodesPout 10;
NmodesPproj 10;

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;

// Specific problem of a stationary case
tolerance 1e-10;

// Reduced simple cicle parameters
residualJumpLim 1e-10;
normalizedResidualLim 1e-10;

bcMethod none;
fluxMethod consistent;
POD_phi Frobenius;

debug 1;
